# Создать строку равную третьему символу введенно
# строки.

str = input()
str_new = str[2]
print(str_new)
