# Создать строку равную предпоследнему символу
# введенно строки.

str = input()
new_str = str[-2]
print(new_str)
