# Создать строку равную предпоследнему символу
# введенно строки.

str = input ()
len = len(str)
new_str = str[len - 2]
print(new_str)
