# Создать строку равную введенно строке без последних двух символов.

str = input()
new_str = str[:-2]
print(new_str)
